Revit 2027 API
BuiltInFailures.RegenFailures.UserCancelledError Property
 Operation is cancelled by the user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UserCancelledError { get; }
Public Shared ReadOnly Property UserCancelledError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UserCancelledError {
	FailureDefinitionId^ get ();
}
static member UserCancelledError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace